config.org


#+TITLE: Emacs Configuration
#+AUTHOR: Phillip B Oldham

* Introduction

This is the Emacs environment I (Phillip B Oldham, Oldham-Made) use for
development. This file is a literate programming document written with org-mode
and org-mode-babel. You can view config.html in a web browser, or read config.org in
Emacs.

I generally only use Emacs on OS X, so there is a lot of customization around that OS
focussed on the railwaycat emacs port: https://github.com/railwaycat/emacs-mac-port.

Inspiration has been taking from the following sources:

- http://www.wilfred.me.uk/.emacs.d/init.org
- http://dl.dropboxusercontent.com/u/3968124/sacha-emacs.html
- https://github.com/jhenahan/emacs.d/blob/master/init.org

** Generation and Usage

init.org is the source file containing my preferences and settings. init.el and
init.html are generated from it.


#+BEGIN_SRC emacs-lisp :tangle yes
  (require 'cl)
  (require 'org)
  (defun export-init-org ()
    "Generate init.html and init.html from the current init.org file."
    (interactive)
    (call-interactively 'org-babel-tangle)
    (call-interactively 'org-export-as-html))
#+END_SRC


To facilitate in formatting the init.html file, assign a CSS file.


#+BEGIN_SRC emacs-lisp :tangle yes
  (setq org-export-html-style-extra "<link rel=\"stylesheet\" href=\"init.css\" />")
#+END_SRC

TODO:
Add the following javascript items:
#+BEGIN_SRC html
<script src="//yandex.st/highlightjs/8.0/highlight.min.js"></script>
<script>hljs.initHighlightingOnLoad();</script>
#+END_SRC

** Licensing

Code I've written (this org file, init.el, and files in `personal`) is MIT licensed.

** Todo

Things to add into this config, and modes to learn to use effectively:

- dired+
- guide-key
- easy-kill
- rebind M-<left|right> to S-M-<left|right> in the following modes (I use M-<left|right> for jumping between words):
  - org-mode
  - markdown mode

* Contents
** Performance

First-off, lets do some performance tweaks to keep things ticking along
nicely.

Let's add some timestamps to the messages so we can see whether anything
is causing emacs to block for a significant amount of time.

#+BEGIN_SRC emacs-lisp :tangle yes
;;; timestamps in *Messages*
(defun current-time-microseconds ()
  (let* ((nowtime (current-time))
         (now-ms (nth 2 nowtime)))
    (concat (format-time-string "[%Y-%m-%dT%T" nowtime) (format ".%d] " now-ms))))

(defadvice message (before test-symbol activate)
  (if (not (string-equal (ad-get-arg 0) "%s%s"))
      (let ((deactivate-mark nil)
            (inhibit-read-only t))
        (save-excursion
          (set-buffer "*Messages*")
          (goto-char (point-max))
          (if (not (bolp))
              (newline))
          (insert (current-time-microseconds))))))
#+END_SRC

Emacs will run garbage collection after `gc-cons-threshold' bytes of
consing. The default value is 800,000 bytes, or ~ 0.7 MiB. By
increasing to 20 MiB we reduce the number of pauses due to
garbage collection, and will help plugins like flx perform much
faster.

#+BEGIN_SRC emacs-lisp :tangle yes
  (setq gc-cons-threshold 20000000)
#+END_SRC

** Startup Tweaks

Stop the start screen from displaying

#+BEGIN_SRC emacs-lisp :tangle yes
(setq inhibit-startup-message t)
#+END_SRC


Hide the unused toolbar

#+BEGIN_SRC emacs-lisp :tangle yes
(when (fboundp 'tool-bar-mode)
  (tool-bar-mode -1))
#+END_SRC


Hide scrollbars

#+BEGIN_SRC emacs-lisp :tangle yes
(when (fboundp 'scroll-bar-mode)
  (scroll-bar-mode -1))
#+END_SRC


Kill the annoying bell

#+BEGIN_SRC emacs-lisp :tangle yes
(setq visible-bell t)
#+END_SRC


Don't insert instructions in the *scratch* buffer

#+BEGIN_SRC emacs-lisp :tangle yes
(setq initial-scratch-message nil)
#+END_SRC


Allow answering 'Yes or No' prompts with Y or N

#+BEGIN_SRC emacs-lisp :tangle yes
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

** Package Management
*** Sources

I use ELPA packages heavily for functionality, primarily the MELPA and Marmalade
repositories. Initalize all the package repos here, so we can use them later.

#+BEGIN_SRC emacs-lisp :tangle yes
(require 'package)
(add-to-list 'package-archives '("melpa" . "http://melpa.milkbox.net/packages/") t)
(add-to-list 'package-archives '("marmalade" . "http://marmalade-repo.org/packages/") t)
(add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/") t)
(package-initialize)
#+END_SRC

Update the local package database if needed before installing packages
#+BEGIN_SRC emacs-lisp :tangle yes
(defadvice package-install (before maybe-refresh-packages activate)
  (unless (or (called-interactively-p) (assq (ad-get-arg 0) package-archive-contents))
    (unless package--initialized
      (package-initialize t))
    (unless (and package-archive-contents (assq (ad-get-arg 0) package-archive-contents))
      (package-refresh-contents))))
#+END_SRC

*** =req-package=

=req-package= is a macro wrapper on top of use-package. It's goal is to simplify
package dependencies management.

#+BEGIN_SRC emacs-lisp :tangle yes
(unless (package-installed-p 'req-package)
  (package-install 'req-package))
(package-initialize)
(require 'req-package)
#+END_SRC

*** Byte-compiling packages

Auto-compile packages so emacs loads faster.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package auto-compile
             :init
             (progn
               (auto-compile-on-load-mode 1)
               (auto-compile-on-save-mode 1)
               ))
#+END_SRC

** Basic Settings

Some very basic settings for my environment

#+BEGIN_SRC emacs-lisp :tangle yes
(setq user-full-name "Phillip B Oldham"
      change-log-default-name "CHANGELOG")
#+END_SRC

Set the exec path from shell on mac systems

# +BEGIN_SRC emacs-lisp :tangle yes
# (req-package exec-path-from-shell)
# (when (memq window-system '(mac ns))
#   (exec-path-from-shell-initialize)
#   (exec-path-from-shell-copy-env "PYTHONPATH"))
# +END_SRC

** Interface
*** Theme

I prefer darker themes as they're easier on my eyes.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-to-list 'custom-theme-load-path (expand-file-name "themes" dotfiles-dir))
(load-theme 'leiptr)
#+END_SRC

I also prefer a smaller font, to get more text onto the screen.

#+BEGIN_SRC emacs-lisp :tangle yes
(set-face-attribute 'default nil :font "Monaco-10:weight=normal")
#+END_SRC

Add font styles to DONE lines.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq org-fontify-done-headline t)
#+END_SRC

*** Recursive Editing

We can make the minibuffer much more useful by enabling recursive
usage. This means that when the minibuffer is active we can still call
commands that require the minibuffer.


#+BEGIN_SRC emacs-lisp :tangle yes
  (setq enable-recursive-minibuffers t)
#+END_SRC


It's easy to lose track of whether we're in a recursive minibuffer or
not. We display the recursion level in the minibuffer to avoid confusion.


#+BEGIN_SRC emacs-lisp :tangle yes
  (minibuffer-depth-indicate-mode 1)
#+END_SRC

*** Cursor

Disable the cursor blink as I find it distracting at times

#+BEGIN_SRC emacs-lisp :tangle yes
(blink-cursor-mode -1)
#+END_SRC

*** Log messages

Reduce the message log to 512 entries

#+BEGIN_SRC emacs-lisp :tangle yes
(setq message-log-max 512)
#+END_SRC

*** Uniquify buffer names

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package uniquify
             :diminish ""
             :init
             (progn
                (setq uniquify-buffer-name-style 'forward)
                ))
#+END_SRC

*** Modeline
I prefer the cleaner Powerline to the usual modeline.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package powerline
             :diminish ""
             :init (powerline-default-theme))
#+END_SRC

Reduce the amount of rubbish in the modeline...

#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook
  (lambda()
    (setq mode-name "el")))
#+END_SRC

*** Line Numbers
Turn line-numbers on everywhere.

#+BEGIN_SRC emacs-lisp :tangle yes
(global-linum-mode 1)
(setq linum-format "%4d")
(setq column-number-mode 1)
#+END_SRC


Allow clicking the line-numbers to select the line(s)

#+BEGIN_SRC emacs-lisp :tangle yes
(defun line-at-click ()
  (save-excursion
  (let ((click-y (cdr (cdr (mouse-position))))
      (line-move-visual-store line-move-visual))
    (setq line-move-visual t)
    (goto-char (window-start))
    (next-line (1- click-y))
    (setq line-move-visual line-move-visual-store)
    (1+ (line-number-at-pos)))))

(defun md-select-linum ()
  (interactive)
  (goto-line (line-at-click))
  (set-mark (point))
  (setq *linum-mdown-line*
    (line-number-at-pos)))

(defun mu-select-linum ()
  (interactive)
  (when *linum-mdown-line*
  (let (mu-line)
    (setq mu-line (line-at-click))
    (goto-line (max *linum-mdown-line* mu-line))
    (set-mark (line-end-position))
    (goto-line (min *linum-mdown-line* mu-line))
    (setq *linum-mdown*
      nil))))

(global-set-key (kbd "<left-margin> <down-mouse-1>") 'md-select-linum)
(global-set-key (kbd "<left-margin> <mouse-1>") 'mu-select-linum)
(global-set-key (kbd "<left-margin> <S-mouse-1>") 'mu-select-linum)
(global-set-key (kbd "<left-margin> <drag-mouse-1>") 'mu-select-linum)
#+END_SRC

