config.el

(require 'cl)
(require 'org)
(defun export-init-org ()
  "Generate init.html and init.html from the current init.org file."
  (interactive)
  (call-interactively 'org-babel-tangle)
  (call-interactively 'org-export-as-html))

(setq org-export-html-style-extra "<link rel=\"stylesheet\" href=\"init.css\" />")

;;; timestamps in *Messages*
(defun current-time-microseconds ()
  (let* ((nowtime (current-time))
         (now-ms (nth 2 nowtime)))
    (concat (format-time-string "[%Y-%m-%dT%T" nowtime) (format ".%d] " now-ms))))

(defadvice message (before test-symbol activate)
  (if (not (string-equal (ad-get-arg 0) "%s%s"))
      (let ((deactivate-mark nil)
            (inhibit-read-only t))
        (save-excursion
          (set-buffer "*Messages*")
          (goto-char (point-max))
          (if (not (bolp))
              (newline))
          (insert (current-time-microseconds))))))

(setq gc-cons-threshold 20000000)

(setq inhibit-startup-message t)

(when (fboundp 'tool-bar-mode)
  (tool-bar-mode -1))

(when (fboundp 'scroll-bar-mode)
  (scroll-bar-mode -1))

(setq visible-bell t)

(setq initial-scratch-message nil)

(fset 'yes-or-no-p 'y-or-n-p)

(when (memq window-system '(mac ns))
  (exec-path-from-shell-initialize)
  (exec-path-from-shell-copy-env "PYTHONPATH"))

(require 'package)
(add-to-list 'package-archives '("melpa" . "http://melpa.milkbox.net/packages/") t)
(add-to-list 'package-archives '("marmalade" . "http://marmalade-repo.org/packages/"))
(add-to-list 'package-archives '("gnu" . "http://elpa.gnu.org/packages/"))
(package-initialize)

(defadvice package-install (before maybe-refresh-packages activate)
  (unless (or (called-interactively-p) (assq (ad-get-arg 0) package-archive-contents))
    (unless package--initialized
      (package-initialize t))
    (unless (and package-archive-contents (assq (ad-get-arg 0) package-archive-contents))
      (package-refresh-contents))))

(unless (package-installed-p 'req-package)
  (package-install 'req-package))
(package-initialize)
(require 'req-package)

(req-package auto-compile
             :init
             (progn
               (auto-compile-on-load-mode 1)
               (auto-compile-on-save-mode 1)
               ))

(setq user-full-name "Phillip B Oldham"
      user-mail-address "phillip.oldham@gmail.com"
      change-log-default-name "CHANGELOG")

(add-to-list 'custom-theme-load-path (expand-file-name "themes" dotfiles-dir))
(load-theme 'leiptr)

(set-face-attribute 'default nil :font "Monaco-10:weight=normal")

(setq org-fontify-done-headline t)

(setq enable-recursive-minibuffers t)

(minibuffer-depth-indicate-mode 1)

(blink-cursor-mode -1)

(setq message-log-max 512)

(req-package uniquify
             :diminish ""
             :init
             (progn
                (setq uniquify-buffer-name-style 'forward)
                ))

(req-package powerline
             :diminish ""
             :init (powerline-default-theme))

(add-hook 'emacs-lisp-mode-hook
  (lambda()
    (setq mode-name "el")))

(global-linum-mode 1)
(setq linum-format "%4d")
(setq column-number-mode 1)

(defun line-at-click ()
  (save-excursion
  (let ((click-y (cdr (cdr (mouse-position))))
      (line-move-visual-store line-move-visual))
    (setq line-move-visual t)
    (goto-char (window-start))
    (next-line (1- click-y))
    (setq line-move-visual line-move-visual-store)
    (1+ (line-number-at-pos)))))

(defun md-select-linum ()
  (interactive)
  (goto-line (line-at-click))
  (set-mark (point))
  (setq *linum-mdown-line*
    (line-number-at-pos)))

(defun mu-select-linum ()
  (interactive)
  (when *linum-mdown-line*
  (let (mu-line)
    (setq mu-line (line-at-click))
    (goto-line (max *linum-mdown-line* mu-line))
    (set-mark (line-end-position))
    (goto-line (min *linum-mdown-line* mu-line))
    (setq *linum-mdown*
      nil))))

(global-set-key (kbd "<left-margin> <down-mouse-1>") 'md-select-linum)
(global-set-key (kbd "<left-margin> <mouse-1>") 'mu-select-linum)
(global-set-key (kbd "<left-margin> <S-mouse-1>") 'mu-select-linum)
(global-set-key (kbd "<left-margin> <drag-mouse-1>") 'mu-select-linum)
