config.org
*** Mouse/Scrolling

Allow scrolling during incremental search

#+BEGIN_SRC emacs-lisp :tangle yes
(setq isearch-allow-scroll t)
#+END_SRC


Scroll by 1 line at the end of the file

#+BEGIN_SRC emacs-lisp :tangle yes
(setq scroll-step 1
      scroll-conservatively 10000)
#+END_SRC


Enable mouse-wheel where available, set it to scroll one line at a time,
and disable acceleration to make it less "jumpy"

#+BEGIN_SRC emacs-lisp :tangle yes
(mouse-wheel-mode t)
(setq mouse-wheel-scroll-amount '(1))
(setq mouse-wheel-progressive-speed nil)
#+END_SRC


Scroll the window under mouse

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mouse-wheel-follow-mouse 't)
#+END_SRC


Emacs does not seem to handle all scroll events on OSX, therefore inertia
scrolling does not work properly. The following is a close approximation.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq redisplay-dont-pause t)
(defun up-single () (interactive) (scroll-up 1))
(defun down-single () (interactive) (scroll-down 1))
(defun up-double () (interactive) (scroll-up 2))
(defun down-double () (interactive) (scroll-down 2))
(defun up-triple () (interactive) (scroll-up 5))
(defun down-triple () (interactive) (scroll-down 5))

(global-set-key [wheel-down] 'up-single)
(global-set-key [wheel-up] 'down-single)
(global-set-key [double-wheel-down] 'up-double)
(global-set-key [double-wheel-up] 'down-double)
(global-set-key [triple-wheel-down] 'up-triple)
(global-set-key [triple-wheel-up] 'down-triple)
#+END_SRC

Enable shift-click for region selection selection

#+BEGIN_SRC emacs-lisp :tangle yes
(define-key global-map (kbd "<S-down-mouse-1>") 'ignore) ; turn off font dialog
(define-key global-map (kbd "<S-mouse-1>") 'mouse-set-point)
(define-key global-map (kbd "<S-down-mouse-1>") 'mouse-save-then-kill)
#+END_SRC

*** Highlight syntax

Turn syntax highlighting on by default

#+BEGIN_SRC emacs-lisp :tangle yes
(global-font-lock-mode 1)
#+END_SRC

*** Highlight regions

Highlight regions/selections

#+BEGIN_SRC emacs-lisp :tangle yes
(setq transient-mark-mode t)
#+END_SRC

*** Highlight indentation

FIXME

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package highlight-indentation
             :init
             (progn
               (set-face-background 'highlight-indentation-face "#222")
               (add-hook 'python-mode-hook 'highlight-indentation-mode)
               ))
#+END_SRC

*** Highlight delimiters

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package rainbow-delimiters
             :diminish ""
             :init
             (progn
               (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
               (add-hook 'python-mode-hook 'rainbow-delimiters-mode)
               ))
#+END_SRC

*** Highlight text that flows past column 80

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package column-enforce-mode
             :diminish ""
             :init (add-hook 'python-mode-hook 'column-enforce-mode))
#+END_SRC

*** Highlight colour references with it's colour

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package rainbow-mode
             :diminish ""
             :defer t
             :init
             (progn
               (add-hook 'clevercss-mode-hook 'rainbow-mode)
               (add-hook 'less-mode-hook 'rainbow-mode)
               (add-hook 'css-mode-hook 'rainbow-mode)
               (add-hook 'css-mode-hook 'rainbow-mode)
               (add-hook 'emacs-lisp-mode-hook 'rainbow-mode)
               ))
#+END_SRC

*** Autocomplete

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package auto-complete
             :init
             (progn
               (add-to-list 'ac-dictionary-directories (expand-file-name "autocomplete" dotfiles-dir))
               (require 'auto-complete-config)
               (ac-config-default)
               (setq ac-use-menu-map t)
               (define-key ac-complete-mode-map "\t" 'ac-complete)
               (define-key ac-complete-mode-map "\r" nil)
               (define-key ac-complete-mode-map [return] nil)
               (define-key ac-complete-mode-map "\C-m" nil)
               (global-set-key "\C-f" 'ac-isearch)))
#+END_SRC

*** Which Function

Disabled for now.

# When inside the definition of something like a class or method, but the
# name of the class or method is not currently in view, =which-function-mode=
# shows the name of the definition the cursor is currently in.

# Add it to specific modes, because I don't need it everywhere (gets
# annoying in org-mode, for instance).

# #+BEGIN_SRC emacs-lisp :tangle yes
# (which-function-mode)
# (add-to-list 'which-func-modes 'python-mode)
# (setq-default header-line-format
#               '((which-func-mode ("" which-func-format " "))))
# #+END_SRC

# Remove it from the mode line, because my modeline is too full as it is.

# #+BEGIN_SRC emacs-lisp :tangle yes
# (setq mode-line-misc-info
#       (assq-delete-all 'which-func-mode mode-line-misc-info))
# #+END_SRC

** Navigation
*** Minibuffer Shortcuts
When selecting a file to visit, // will mean /
and ~ will mean $HOME regardless of preceding text

#+BEGIN_SRC emacs-lisp :tangle yes
(setq file-name-shadow-tty-properties '(invisible t))
(file-name-shadow-mode 1)
#+END_SRC

*** Open recently opened files quickly

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package recentf
             :diminish ""
             :init
             (progn
               (recentf-mode 1)
               (setq recentf-max-save-items 500
                     recentf-max-menu-items 50)))
#+END_SRC

*** IDO

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package ido-ubiquitous
             :require (ido recentf)
             :diminish ""
             :init
             (progn
               (ido-mode t)
               (setq ido-confirm-unique-completion nil)
               (setq ido-create-new-buffer 'always)
               (setq ido-enable-flex-matching t)
               (setq ido-ignore-extensions t)
               (setq ido-use-virtual-buffers t)
               (ido-ubiquitous-mode 1)
               ))
#+END_SRC

Flx is rather useful, so let's add that too

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package flx-ido
             :require flx
             :init
             (progn
               (flx-ido-mode 1)
               ))
#+END_SRC

Use ido for recently open files

#+BEGIN_SRC emacs-lisp :tangle yes
(defun ido-recentf-open ()
  "Use `ido-completing-read' to \\[find-file] a recent file"
  (interactive)
  (if (find-file (ido-completing-read "Find recent file: " recentf-list))
      (message "Opening file...")
    (message "Aborting")))

(global-set-key (kbd "H-S-o") 'ido-recentf-open)
#+END_SRC

*** Smex

Improve M-x with recent/popular commands at prompt.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package smex
             :diminish ""
             :bind (("M-x" . smex)
                    ("M-X" . smex-major-mode-commands)
                    ("C-c C-c M-x" . execute-extended-command)))
#+END_SRC

*** Projectile

Automagically interact with "projects"; git, mercurial, bazaar, and darcs repos
are seen as projects by default.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package projectile
             :diminish ""
             :init
             (progn
               (projectile-global-mode)
               ))
#+END_SRC

** Key bindings
*** Mac
Set Option as Meta, and add Cmd as "Hyper"

#+BEGIN_SRC emacs-lisp :tangle yes
(setq mac-command-modifier 'alt mac-option-modifier 'meta)
(setq mac-command-modifier 'hyper)
#+END_SRC

Undo/redo

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [(hyper z)] 'undo)
(global-set-key [(hyper shift z)] 'redo)
#+END_SRC

Select all

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [(hyper a)] 'mark-whole-buffer)
#+END_SRC

Cut/copy/paste

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [(hyper x)] 'kill-region)
(global-set-key [(hyper c)] 'kill-ring-save)
(global-set-key [(hyper v)] 'yank)
#+END_SRC

Open/save/close/quit

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [(hyper o)] 'find-file)
(global-set-key [(hyper s)] 'save-buffer)
(global-set-key [(hyper w)]
                (lambda () (interactive) (my-kill-buffer (current-buffer))))
(global-set-key [(hyper q)] 'save-buffers-kill-emacs)
#+END_SRC

Minimise/hide

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [(hyper m)] 'iconify-frame)
(global-set-key [(hyper h)] 'ns-do-hide-emacs)
#+END_SRC

Search

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [(hyper f)] 'isearch-forward)
(global-set-key [(hyper g)] 'isearch-repeat-forward)
#+END_SRC

Moving the cursor

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [(hyper left)] 'beginning-of-line)
(global-set-key [(hyper right)] 'end-of-line)
(global-set-key [(hyper t)] 'beginning-of-buffer)
(global-set-key [(hyper b)] 'end-of-buffer)
#+END_SRC

Changing case

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [(hyper u)] 'upcase-region)
(global-set-key [(hyper l)] 'downcase-region)
#+END_SRC

Goto line

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [(hyper j)] 'goto-line)
#+END_SRC

Remove the space in a selection to join lines

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "H-S-<backspace>") 'join-line)
#+END_SRC

Repeat the last command

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [(hyper shift r)] 'repeat)
#+END_SRC

Use the Escape key to escape the keyboard

#+BEGIN_SRC emacs-lisp :tangle yes
(define-key local-function-key-map [cancel] [H-Esc])
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+END_SRC

Allow euro to be entered

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "M-2") '(lambda () (interactive) (insert "€")))
#+END_SRC

Allow hash to be entered

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "M-3") '(lambda () (interactive) (insert "#")))
#+END_SRC

Text resizing

#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key (kbd "H-=") 'text-scale-increase)
(global-set-key (kbd "H--") 'text-scale-decrease)
#+END_SRC

