config.el

(setq isearch-allow-scroll t)

(setq scroll-step 1
      scroll-conservatively 10000)

(mouse-wheel-mode t)
(setq mouse-wheel-scroll-amount '(1))
(setq mouse-wheel-progressive-speed nil)

(setq mouse-wheel-follow-mouse 't)

(setq redisplay-dont-pause t)
(defun up-single () (interactive) (scroll-up 1))
(defun down-single () (interactive) (scroll-down 1))
(defun up-double () (interactive) (scroll-up 2))
(defun down-double () (interactive) (scroll-down 2))
(defun up-triple () (interactive) (scroll-up 5))
(defun down-triple () (interactive) (scroll-down 5))

(global-set-key [wheel-down] 'up-single)
(global-set-key [wheel-up] 'down-single)
(global-set-key [double-wheel-down] 'up-double)
(global-set-key [double-wheel-up] 'down-double)
(global-set-key [triple-wheel-down] 'up-triple)
(global-set-key [triple-wheel-up] 'down-triple)

(define-key global-map (kbd "<S-down-mouse-1>") 'ignore) ; turn off font dialog
(define-key global-map (kbd "<S-mouse-1>") 'mouse-set-point)
(define-key global-map (kbd "<S-down-mouse-1>") 'mouse-save-then-kill)

(global-font-lock-mode 1)

(setq transient-mark-mode t)

(req-package highlight-indentation
             :init
             (progn
               (set-face-background 'highlight-indentation-face "#222")
               (add-hook 'python-mode-hook 'highlight-indentation-mode)
               ))

(req-package rainbow-delimiters
             :diminish ""
             :init
             (progn
               (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
               (add-hook 'python-mode-hook 'rainbow-delimiters-mode)
               ))

(req-package column-enforce-mode
             :diminish ""
             :init (add-hook 'python-mode-hook 'column-enforce-mode))

(req-package rainbow-mode
             :diminish ""
             :defer t
             :init
             (progn
               (add-hook 'clevercss-mode-hook 'rainbow-mode)
               (add-hook 'less-mode-hook 'rainbow-mode)
               (add-hook 'css-mode-hook 'rainbow-mode)
               (add-hook 'css-mode-hook 'rainbow-mode)
               (add-hook 'emacs-lisp-mode-hook 'rainbow-mode)
               ))

(req-package auto-complete
             :init
             (progn
               (add-to-list 'ac-dictionary-directories (expand-file-name "autocomplete" dotfiles-dir))
               (require 'auto-complete-config)
               (ac-config-default)
               (setq ac-use-menu-map t)
               (define-key ac-complete-mode-map "\t" 'ac-complete)
               (define-key ac-complete-mode-map "\r" nil)
               (define-key ac-complete-mode-map [return] nil)
               (define-key ac-complete-mode-map "\C-m" nil)
               (global-set-key "\C-f" 'ac-isearch)))

(setq file-name-shadow-tty-properties '(invisible t))
(file-name-shadow-mode 1)

(req-package recentf
             :diminish ""
             :init
             (progn
               (recentf-mode 1)
               (setq recentf-max-save-items 500
                     recentf-max-menu-items 50)))

(req-package ido-ubiquitous
             :require (ido recentf)
             :diminish ""
             :init
             (progn
               (ido-mode t)
               (setq ido-confirm-unique-completion nil)
               (setq ido-create-new-buffer 'always)
               (setq ido-enable-flex-matching t)
               (setq ido-ignore-extensions t)
               (setq ido-use-virtual-buffers t)
               (ido-ubiquitous-mode 1)
               ))

(req-package flx-ido
             :require flx
             :init
             (progn
               (flx-ido-mode 1)
               ))

(defun ido-recentf-open ()
  "Use `ido-completing-read' to \\[find-file] a recent file"
  (interactive)
  (if (find-file (ido-completing-read "Find recent file: " recentf-list))
      (message "Opening file...")
    (message "Aborting")))

(global-set-key (kbd "H-S-o") 'ido-recentf-open)

(req-package smex
             :diminish ""
             :bind (("M-x" . smex)
                    ("M-X" . smex-major-mode-commands)
                    ("C-c C-c M-x" . execute-extended-command)))

(req-package projectile
             :diminish ""
             :init
             (progn
               (projectile-global-mode)
               ))

(setq mac-command-modifier 'alt mac-option-modifier 'meta)
(setq mac-command-modifier 'hyper)

(global-set-key [(hyper z)] 'undo)
(global-set-key [(hyper shift z)] 'redo)

(global-set-key [(hyper a)] 'mark-whole-buffer)

(global-set-key [(hyper x)] 'kill-region)
(global-set-key [(hyper c)] 'kill-ring-save)
(global-set-key [(hyper v)] 'yank)

(global-set-key [(hyper o)] 'find-file)
(global-set-key [(hyper s)] 'save-buffer)
(global-set-key [(hyper w)]
                (lambda () (interactive) (my-kill-buffer (current-buffer))))
(global-set-key [(hyper q)] 'save-buffers-kill-emacs)

(global-set-key [(hyper m)] 'iconify-frame)
(global-set-key [(hyper h)] 'ns-do-hide-emacs)

(global-set-key [(hyper f)] 'isearch-forward)
(global-set-key [(hyper g)] 'isearch-repeat-forward)

(global-set-key [(hyper left)] 'beginning-of-line)
(global-set-key [(hyper right)] 'end-of-line)
(global-set-key [(hyper t)] 'beginning-of-buffer)
(global-set-key [(hyper b)] 'end-of-buffer)

(global-set-key [(hyper u)] 'upcase-region)
(global-set-key [(hyper l)] 'downcase-region)

(global-set-key [(hyper j)] 'goto-line)

(global-set-key (kbd "H-S-<backspace>") 'join-line)

(global-set-key [(hyper shift r)] 'repeat)

(define-key local-function-key-map [cancel] [H-Esc])
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(global-set-key (kbd "M-2") '(lambda () (interactive) (insert "€")))

(global-set-key (kbd "M-3") '(lambda () (interactive) (insert "#")))

(global-set-key (kbd "H-=") 'text-scale-increase)
(global-set-key (kbd "H--") 'text-scale-decrease)
