config.org
*** Key chords
#+BEGIN_SRC emacs-lisp :tangle yes
(req-package key-chord
             :init
             (progn
               (key-chord-mode 1)
               (when (memq window-system '(mac ns))
                 (key-chord-define-global "§1" 'smex))
               (key-chord-define-global "o0" 'find-file)
               (key-chord-define-global "o=" 'dired-jump)
               (key-chord-define-global "o-" 'ido-recentf-open)
               (key-chord-define-global "o[" 'find-file-at-point)
               (key-chord-define-global "p-" 'projectile-find-file)
               (key-chord-define-global "t5" 'untabify)
               (key-chord-define-global "r4" 'replace-string)
               (key-chord-define-global "r3" 'vr/query-replace)
               (key-chord-define-global "e3" 'er/expand-region)
               (key-chord-define-global "e2" 'er/contract-region)
               (key-chord-define-global "p[" 'fill-paragraph)
               (key-chord-define-global "p]" 'unfill-paragraph)
               (key-chord-define-global " k" 'delete-trailing-whitespace)
               (key-chord-define-global "m," 'my-previous-like-this)
               (key-chord-define-global "m." 'my-more-like-this)
               (key-chord-define-global "s1" 'ispell-region)
               (key-chord-define-global "d3" 'deft)
               ))
#+END_SRC
** Buffers
*** Initial buffer major mode: text

#+BEGIN_SRC emacs-lisp :tangle yes
(setq initial-major-mode 'text-mode)
#+END_SRC

*** New Empty Buffer

#+BEGIN_SRC emacs-lisp :tangle yes
(defun new-empty-buffer ()
  "Create a new buffer called untitled(<n>)"
  (interactive)
  (let ((newbuf (generate-new-buffer-name "untitled")))
    (switch-to-buffer newbuf)))

(global-set-key [(hyper n)] 'new-empty-buffer)
#+END_SRC

*** Scratch buffer management

Now let's make the *scratch* buffer persistent across sessions

#+BEGIN_SRC  emacs-lisp :tangle yes
(defvar persistent-scratch-filename
    (expand-file-name ".emacs-persistent-scratch" dotfiles-dir)
    "Location of *scratch* file contents for persistent-scratch.")

(defun save-persistent-scratch ()
  "Write the contents of *scratch* to the file name
  PERSISTENT-SCRATCH-FILENAME"
  (with-current-buffer (get-buffer "*scratch*")
    (write-region (point-min) (point-max)
                  persistent-scratch-filename)))

(defun load-persistent-scratch ()
  "Load the contents of PERSISTENT-SCRATCH-FILENAME into the
  scratch buffer, clearing its contents first."
  (if (file-exists-p persistent-scratch-filename)
      (with-current-buffer (get-buffer "*scratch*")
        (delete-region (point-min) (point-max))
        (shell-command (format "cat %s" persistent-scratch-filename) (current-buffer)))))

(load-persistent-scratch)

(push #'save-persistent-scratch kill-emacs-hook)
#+END_SRC

*** Persist certain buffers

Bury certain buffers instead of kill them

#+BEGIN_SRC emacs-lisp :tangle yes
(setq bury-buffer-names '("*scratch*" "*Messages*"))

(defun kill-buffer-query-functions-maybe-bury ()
  "Bury certain buffers instead of killing them."
  (if (member (buffer-name (current-buffer)) bury-buffer-names)
      (progn
        (kill-region (point-min) (point-max))
        (bury-buffer)
        nil)
    t))

(add-hook 'kill-buffer-query-functions 'kill-buffer-query-functions-maybe-bury)

(defun my-kill-buffer (buffer)
  "Protect some special buffers from getting killed."
  (interactive (list (current-buffer)))
  (if (member (buffer-name buffer) bury-buffer-names)
      (call-interactively 'bury-buffer buffer)
    (kill-buffer buffer)))
#+END_SRC

*** Indent Whole Buffer

#+BEGIN_SRC emacs-lisp :tangle yes
(defun indent-whole-buffer ()
  "indent whole buffer"
  (interactive)
  (delete-trailing-whitespace)
  (indent-region (point-min) (point-max) nil)
  (untabify (point-min) (point-max)))
#+END_SRC

*** Kill all buffers except current

#+BEGIN_SRC emacs-lisp :tangle yes
(defun kill-all-buffers-except-current ()
  "Kill all buffers except current buffer."
  (interactive)
  (let ((current-buf (current-buffer)))
    (dolist (buffer (buffer-list))
      (set-buffer buffer)
      (unless (eq current-buf buffer)
        (kill-buffer buffer)))))
#+END_SRC

*** Switching buffers
#+BEGIN_SRC emacs-lisp :tangle yes
(defun custom-ignore-buffer (str)
  (or
   ;;buffers I don't want to switch to
   (string-match "\\*Buffer List\\*" str)
   (string-match "\\*Compile-Log\\*" str)
   (string-match "^TAGS" str)
   (string-match "^\\*Messages\\*$" str)
   (string-match "^\\*Completions\\*$" str)
   (string-match "^\\*Flymake error messages\\*$" str)
   (string-match "^\\*Flycheck error messages\\*$" str)
   (string-match "^\\*SPEEDBAR\\*" str)
   (string-match "^ " str)

   ;;Test to see if the window is visible on an existing visible frame.
   ;;Because I can always ALT-TAB to that visible frame, I never want to
   ;;Ctrl-TAB to that buffer in the current frame.  That would cause
   ;;a duplicate top-level buffer inside two frames.
   (memq str
         (mapcar
          (lambda (x)
            (buffer-name
             (window-buffer
              (frame-selected-window x))))
          (visible-frame-list)))
   ))

(defun custom-switch-buffer (ls)
  "Switch to next buffer in ls skipping unwanted ones."
  (let* ((ptr ls)
         bf bn go
         )
    (while (and ptr (null go))
      (setq bf (car ptr)  bn (buffer-name bf))
      (if (null (custom-ignore-buffer bn))        ;skip over
   (setq go bf)
        (setq ptr (cdr ptr))
        )
      )
    (if go
        (switch-to-buffer go))))

(defun custom-prev-buffer ()
  "Switch to previous buffer in current window."
  (interactive)
  (custom-switch-buffer (reverse (buffer-list))))

(global-set-key [(hyper down)] 'custom-prev-buffer)

(defun custom-next-buffer ()
  "Switch to the other buffer (2nd in list-buffer) in current window."
  (interactive)
  (bury-buffer (current-buffer))
  (custom-switch-buffer (buffer-list)))

(global-set-key [(hyper up)] 'custom-next-buffer)
    #+END_SRC

*** Copy buffer path to kill ring
#+BEGIN_SRC emacs-lisp :tangle yes
(defun copy-full-path-to-kill-ring ()
  "copy buffer's full path to kill ring"
  (interactive)
  (when buffer-file-name
    (kill-new (file-truename buffer-file-name))))
#+END_SRC
*** Echo buffer path
#+BEGIN_SRC emacs-lisp :tangle yes
(defun describe-variable-short (var)
  (interactive "vVariable: ")
  (message (format "%s: %s" (symbol-name var) (symbol-value var))) )

(defun get-buffer-path ()
  "print the buffer path in the mini buffer"
  (interactive)
  (when buffer-file-name
    (kill-new (file-truename buffer-file-name))
    (message (format "Path: %s (copied to kill-ring)" (file-truename buffer-file-name)))
    ))
#+END_SRC
** Files
*** Copy Filename to Clipboard

#+BEGIN_SRC emacs-lisp :tangle yes
(defun copy-file-name-to-clipboard ()
  "Copy the current buffer file name to the clipboard."
  (interactive)
  (let ((filename (if (equal major-mode 'dired-mode)
                      default-directory
                    (buffer-file-name))))
    (when filename
      (kill-new filename)
      (message "Copied buffer file name '%s' to the clipboard." filename))))
#+END_SRC

*** Open Filename with External Program

#+BEGIN_SRC emacs-lisp :tangle yes
(defun open-with ()
  "Simple function that allows us to open the underlying
file of a buffer in an external program."
  (interactive)
  (when buffer-file-name
    (shell-command (concat
                    (if (eq system-type 'darwin)
                        "open"
                      (read-shell-command "Open current file with: "))
                    " "
                    buffer-file-name))))
#+END_SRC

*** Rename File and Buffer

#+BEGIN_SRC emacs-lisp :tangle yes
(defun rename-file-and-buffer ()
  "Rename the current buffer and file it is visiting."
  (interactive)
  (let ((filename (buffer-file-name)))
    (if (not (and filename (file-exists-p filename)))
        (message "Buffer is not visiting a file!")
      (let ((new-name (read-file-name "New name: " filename)))
        (cond
         ((vc-backend filename) (vc-rename-file filename new-name))
         (t
          (rename-file filename new-name t)
          (rename-buffer new-name)
          (set-visited-file-name new-name)
          (set-buffer-modified-p nil)))))))
#+END_SRC

