config.org
*** Move File and Buffer

#+BEGIN_SRC emacs-lisp :tangle yes
(defun move-buffer-file (dir)
  "Move both current buffer and file it's visiting to DIR."
  (interactive "DNew directory: ")
  (let* ((name (buffer-name))
         (filename (buffer-file-name))
         (dir
          (if (string-match dir "\\(?:/\\|\\\\)$")
              (substring dir 0 -1) dir))
         (newname (concat dir "/" name)))
    (if (not filename)
        (message "Buffer '%s' is not visiting a file!" name)
      (copy-file filename newname 1)
      (delete-file filename)
      (set-visited-file-name newname)
      (set-buffer-modified-p nil)
      t)))
#+END_SRC

*** Reloading
Always reload the file on disk when it updates

#+BEGIN_SRC emacs-lisp :tangle yes
(global-auto-revert-mode 1)
#+END_SRC

*** Autosaves and Backups
Disable autosaving of files

#+BEGIN_SRC emacs-lisp :tangle yes
(setq auto-save-default nil)
#+END_SRC


Stop making backup files

#+BEGIN_SRC emacs-lisp :tangle yes
(setq make-backup-files nil)
#+END_SRC

*** Saving
Always append a new line to the file

#+BEGIN_SRC emacs-lisp :tangle yes
(setq require-final-newline t)
#+END_SRC

Clean whitespace intelligently on save

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package whitespace-cleanup-mode
             :diminish ""
             :init (global-whitespace-cleanup-mode))
#+END_SRC

** Moving Around
*** By indentation

`C-a' normally moves us to the beginning of the line
unconditionally. This version is more useful, as it moves to the
first non-whitespace character if we're already at the beginning of
the line. Repeated use of `C-a' toggles between these two positions.


#+BEGIN_SRC emacs-lisp :tangle yes
  (defun beginning-of-line-dwim ()
    "Toggles between moving point to the first non-whitespace character, and
  the start of the line."
    (interactive)
    (let ((start-position (point)))
      (move-beginning-of-line nil)
      (when (= (point) start-position)
          (back-to-indentation))))

  (global-set-key (kbd "C-a") 'beginning-of-line-dwim)
  (global-set-key (kbd "H-<left>") 'beginning-of-line-dwim)
#+END_SRC

*** By last change
It can be rather handy to jump to the last changed area in a file.

KEYBINDING: "M -"

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package goto-last-change
             :diminish ""
             :bind ("H-M-<left>" . goto-last-change))
#+END_SRC


# *** By symbol

# It's extremely useful to be able to move between different occurrences
# of the same symbol.


# #+BEGIN_SRC emacs-lisp :tangle yes
#   (global-set-key (kbd "M-n") 'highlight-symbol-next)
#   (global-set-key (kbd "M-p") 'highlight-symbol-prev)
# #+END_SRC


# Jumping to the first occurrence of the symbol is handy for finding
# where a symbol was imported.


# #+BEGIN_SRC emacs-lisp :tangle yes
#   (defun highlight-symbol-first ()
#     "Jump to the first location of symbol at point."
#     (interactive)
#     (push-mark)
#     (eval
#      `(progn
#         (goto-char (point-min))
#         (search-forward-regexp
#          (rx symbol-start ,(thing-at-point 'symbol) symbol-end)
#          nil t)
#         (beginning-of-thing 'symbol))))

#   (global-set-key (kbd "M-P") 'highlight-symbol-first)
# #+END_SRC


# More rarely, it's useful to be able to jump to the last occurrence of
# a symbol.


# #+BEGIN_SRC emacs-lisp :tangle yes
#   (defun highlight-symbol-last ()
#     "Jump to the last location of symbol at point."
#     (interactive)
#     (push-mark)
#     (eval
#      `(progn
#         (goto-char (point-max))
#         (search-backward-regexp
#          (rx symbol-start ,(thing-at-point 'symbol) symbol-end)
#          nil t))))

#   (global-set-key (kbd "M-N") 'highlight-symbol-last)
# #+END_SRC

** Cursors
*** Selecting by current thing

Select the next thing like the current thing at point

#+BEGIN_SRC emacs-lisp :tangle yes
(defun my-more-like-this (arg)
  (interactive "p")
  (if (not (region-active-p))
      (select-at-point)
    (mc/mark-next-like-this arg)
    )
  )
#+END_SRC

Select the previous thing like the current thing at point

#+BEGIN_SRC emacs-lisp :tangle yes
(defun my-previous-like-this (arg)
  (interactive "p")
  (if (not (region-active-p))
      (select-at-point)
    (mc/mark-previous-like-this arg)
    )
  )
#+END_SRC

Select the thing at point

#+BEGIN_SRC emacs-lisp :tangle yes
(defun select-at-point ()
  (interactive)
  (setq default (thing-at-point 'word))
  (setq bds (bounds-of-thing-at-point 'word))
  (setq p1 (car bds))
  (setq p2 (cdr bds))
  (set-mark p1)
  (goto-char p2)
)
#+END_SRC

** Editing
*** Showing changes
Highlight changes to the buffer caused by commands such as ‘undo’, ‘yank’/’yank-pop’, etc.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package volatile-highlights
             :diminish volatile-highlights-mode
             :init (volatile-highlights-mode t))
#+END_SRC

*** Tabs
Since I generally develop with languages that adhere to the "off-side" rule
(eg, Python) always replace tabs with spaces.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq-default indent-tabs-mode nil)
#+END_SRC


Set tab width to 4 for all buffers

#+BEGIN_SRC emacs-lisp :tangle yes
(setq-default tab-width 4)
#+END_SRC

*** Selecting
I use =expand-region= to help select large blocks of text

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package expand-region
             :diminish ""
             :bind (("H-e" . er/expand-region)
                    ("H-S-e" . er/contract-region)))
#+END_SRC

*** Moving text
Move selected regions around using the keyboard

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package move-text
             :diminish ""
             :bind (("H-S-<up>" . move-text-up)
                    ("H-S-<down>" . move-text-down)))
#+END_SRC

*** Overwriting

When there's an active selection, delete on inserting new text (overwrite)

#+BEGIN_SRC emacs-lisp :tangle yes
(delete-selection-mode +1)
#+END_SRC

*** Undo
Standard Emacs undo is kind of confusing. [[http://www.dr-qubit.org/emacs.php#undo-tree][undo-tree]] replaces this with a
simpler tree structure. It also allows us to visualize the tree directly.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package undo-tree
             :ensure undo-tree
             :diminish ""
             :init (global-undo-tree-mode))
#+END_SRC

*** CUA

#+BEGIN_SRC emacs-lisp :tangle yes
(setq cua-enable-cua-keys nil)
(setq cua-highlight-region-shift-only t)
(setq cua-toggle-set-mark nil)
(cua-mode)
#+END_SRC
*** Auto-pair braces

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package autopair
             :diminish autopair-mode
             :init
             (progn
              (autopair-global-mode)
              (setq show-paren-delay 0)
              (show-paren-mode t)
              (setq show-paren-style 'parenthesis)
              (add-hook 'term-mode-hook
                        #'(lambda ()
                            (setq autopair-dont-activate t)
                            (autopair-mode -1)))
              ))
#+END_SRC

*** Changing Case

#+BEGIN_SRC emacs-lisp :tangle yes
(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes
(defun toggle-letter-case ()
  "Toggle the letter case of current word or text selection.
Toggles between: “all lower”, “Init Caps”, “ALL CAPS”."
  (interactive)
  (let (p1 p2 (deactivate-mark nil) (case-fold-search nil))
    (if (region-active-p)
        (setq p1 (region-beginning) p2 (region-end))
      (let ((bds (bounds-of-thing-at-point 'word) ) )
        (setq p1 (car bds) p2 (cdr bds)) ) )

    (when (not (eq last-command this-command))
      (save-excursion
        (goto-char p1)
        (cond
         ((looking-at "[[:lower:]][[:lower:]]") (put this-command 'state "all lower"))
         ((looking-at "[[:upper:]][[:upper:]]") (put this-command 'state "all caps") )
         ((looking-at "[[:upper:]][[:lower:]]") (put this-command 'state "init caps") )
         ((looking-at "[[:lower:]]") (put this-command 'state "all lower"))
         ((looking-at "[[:upper:]]") (put this-command 'state "all caps") )
         (t (put this-command 'state "all lower") ) ) ) )

    (cond
     ((string= "all lower" (get this-command 'state))
      (upcase-initials-region p1 p2) (put this-command 'state "init caps"))
     ((string= "init caps" (get this-command 'state))
      (upcase-region p1 p2) (put this-command 'state "all caps"))
     ((string= "all caps" (get this-command 'state))
      (downcase-region p1 p2) (put this-command 'state "all lower")) )
    ))

(global-set-key (kbd "H-k") 'toggle-letter-case)
#+END_SRC

*** Sort lines, case insensitive

#+BEGIN_SRC emacs-lisp :tangle yes
(defun sort-lines-nocase ()
  (interactive)
  (let ((sort-fold-case t))
    (call-interactively 'sort-lines)))
#+END_SRC

*** Replace string, case sensitive

#+BEGIN_SRC emacs-lisp :tangle yes
(defun replace-string-withcase ()
  (interactive)
  (let ((case-fold-search nil))
    (call-interactively 'replace-string)))
#+END_SRC

*** Fix/replace "Smart Quotes"

#+BEGIN_SRC emacs-lisp :tangle yes
(defun fix-quotes (beg end)
  "Replace 'smart quotes' in buffer or region with ascii quotes."
  (interactive "r")
  (format-replace-strings '(("\x201C" . "\"")
                            ("\x201D" . "\"")
                            ("\x2018" . "'")
                            ("\x2019" . "'"))
                          nil beg end))
#+END_SRC

*** Remove ^M

#+BEGIN_SRC emacs-lisp :tangle yes
(defun remove-control-m ()
  (interactive)
  (goto-char 1)
  (while (search-forward "
" nil t)
    (replace-match "" t nil)))
#+END_SRC

