config.el

(defun move-buffer-file (dir)
  "Move both current buffer and file it's visiting to DIR."
  (interactive "DNew directory: ")
  (let* ((name (buffer-name))
         (filename (buffer-file-name))
         (dir
          (if (string-match dir "\\(?:/\\|\\\\)$")
              (substring dir 0 -1) dir))
         (newname (concat dir "/" name)))
    (if (not filename)
        (message "Buffer '%s' is not visiting a file!" name)
      (copy-file filename newname 1)
      (delete-file filename)
      (set-visited-file-name newname)
      (set-buffer-modified-p nil)
      t)))

(global-auto-revert-mode 1)

(setq auto-save-default nil)

(setq make-backup-files nil)

(setq require-final-newline t)

(req-package whitespace-cleanup-mode
             :diminish ""
             :init (global-whitespace-cleanup-mode))

(defun beginning-of-line-dwim ()
  "Toggles between moving point to the first non-whitespace character, and
the start of the line."
  (interactive)
  (let ((start-position (point)))
    (move-beginning-of-line nil)
    (when (= (point) start-position)
        (back-to-indentation))))

(global-set-key (kbd "C-a") 'beginning-of-line-dwim)
(global-set-key (kbd "H-<left>") 'beginning-of-line-dwim)

(req-package goto-last-change
             :diminish ""
             :bind ("H-M-<left>" . goto-last-change))

(defun my-more-like-this (arg)
  (interactive "p")
  (if (not (region-active-p))
      (select-at-point)
    (mc/mark-next-like-this arg)
    )
  )

(defun my-previous-like-this (arg)
  (interactive "p")
  (if (not (region-active-p))
      (select-at-point)
    (mc/mark-previous-like-this arg)
    )
  )

(defun select-at-point ()
  (interactive)
  (setq default (thing-at-point 'word))
  (setq bds (bounds-of-thing-at-point 'word))
  (setq p1 (car bds))
  (setq p2 (cdr bds))
  (set-mark p1)
  (goto-char p2)
)

(req-package volatile-highlights
             :diminish volatile-highlights-mode
             :init (volatile-highlights-mode t))

(setq-default indent-tabs-mode nil)

(setq-default tab-width 4)

(req-package expand-region
             :diminish ""
             :bind (("H-e" . er/expand-region)
                    ("H-S-e" . er/contract-region)))

(req-package move-text
             :diminish ""
             :bind (("H-S-<up>" . move-text-up)
                    ("H-S-<down>" . move-text-down)))

(delete-selection-mode +1)

(req-package undo-tree
             :ensure undo-tree
             :diminish ""
             :init (global-undo-tree-mode))

(setq cua-enable-cua-keys nil)
(setq cua-highlight-region-shift-only t)
(setq cua-toggle-set-mark nil)
(cua-mode)

(req-package autopair
             :diminish autopair-mode
             :init
             (progn
              (autopair-global-mode)
              (setq show-paren-delay 0)
              (show-paren-mode t)
              (setq show-paren-style 'parenthesis)
              (add-hook 'term-mode-hook
                        #'(lambda ()
                            (setq autopair-dont-activate t)
                            (autopair-mode -1)))
              ))

(put 'downcase-region 'disabled nil)
(put 'upcase-region 'disabled nil)

(defun toggle-letter-case ()
  "Toggle the letter case of current word or text selection.
Toggles between: “all lower”, “Init Caps”, “ALL CAPS”."
  (interactive)
  (let (p1 p2 (deactivate-mark nil) (case-fold-search nil))
    (if (region-active-p)
        (setq p1 (region-beginning) p2 (region-end))
      (let ((bds (bounds-of-thing-at-point 'word) ) )
        (setq p1 (car bds) p2 (cdr bds)) ) )

    (when (not (eq last-command this-command))
      (save-excursion
        (goto-char p1)
        (cond
         ((looking-at "[[:lower:]][[:lower:]]") (put this-command 'state "all lower"))
         ((looking-at "[[:upper:]][[:upper:]]") (put this-command 'state "all caps") )
         ((looking-at "[[:upper:]][[:lower:]]") (put this-command 'state "init caps") )
         ((looking-at "[[:lower:]]") (put this-command 'state "all lower"))
         ((looking-at "[[:upper:]]") (put this-command 'state "all caps") )
         (t (put this-command 'state "all lower") ) ) ) )

    (cond
     ((string= "all lower" (get this-command 'state))
      (upcase-initials-region p1 p2) (put this-command 'state "init caps"))
     ((string= "init caps" (get this-command 'state))
      (upcase-region p1 p2) (put this-command 'state "all caps"))
     ((string= "all caps" (get this-command 'state))
      (downcase-region p1 p2) (put this-command 'state "all lower")) )
    ))

(global-set-key (kbd "H-k") 'toggle-letter-case)

(defun sort-lines-nocase ()
  (interactive)
  (let ((sort-fold-case t))
    (call-interactively 'sort-lines)))

(defun replace-string-withcase ()
  (interactive)
  (let ((case-fold-search nil))
    (call-interactively 'replace-string)))

(defun fix-quotes (beg end)
  "Replace 'smart quotes' in buffer or region with ascii quotes."
  (interactive "r")
  (format-replace-strings '(("\x201C" . "\"")
                            ("\x201D" . "\"")
                            ("\x2018" . "'")
                            ("\x2019" . "'"))
                          nil beg end))

(defun remove-control-m ()
  (interactive)
  (goto-char 1)
  (while (search-forward "
" nil t)
    (replace-match "" t nil)))
