config.org
*** Wrap region
=wrap-region= is a minor mode that wraps a region with
punctuations. For tagged markup modes, such as HTML and XML, it
wraps with tags.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package wrap-region
             :diminish ""
             :init
             (progn
               (wrap-region-global-mode t)
               (setq wrap-region-keep-mark t)
               (add-to-list 'wrap-region-tag-active-modes 'sgml-mode)
               (defadvice wrap-region-trigger (before disable-autopair activate)
                 (if (region-active-p)
                     (autopair-global-mode -1)))
               (defadvice wrap-region-trigger (after re-enable-autopair activate)
                 (if (region-active-p)
                     (autopair-global-mode 1)))
               ))
#+END_SRC

*** Edit multiple regions at the same time

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package iedit)
#+END_SRC

*** Rename SGML tag
I work with XML and XSL a lot, so being able to quickly rename a tag is crucial.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'sgml-mode-hook
  (lambda ()
    (require 'rename-sgml-tag)
    (define-key sgml-mode-map (kbd "C-c C-r") 'rename-sgml-tag)))
#+END_SRC

*** Zen-coding
Major mode for quickly creating HTML fragments from a CSS-like syntax

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package zencoding-mode
             :diminish ""
             :init (add-hook 'sgml-mode-hook 'zencoding-mode))
#+END_SRC
*** Unfill paragraph

Unfill functions providing the inverse of fill-paragraph and fill-region

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package unfill
             :diminish ""
             :init (setq-default fill-column 80))
#+END_SRC

*** Fix whitespace

Always show trailing whitespace

#+BEGIN_SRC emacs-lisp :tangle yes
(setq-default show-trailing-whitespace t)
#+END_SRC

Handy little function that replaces all the whitespace
in a region with a single space

#+BEGIN_SRC emacs-lisp :tangle yes
(defun fix-whitespace-in-region (beg end)
  "replace all whitespace in the region with single spaces"
  (interactive "r")
  (save-excursion
    (save-restriction
      (narrow-to-region beg end)
      (goto-char (point-min))
      (while (re-search-forward "\\s-+" nil t)
        (replace-match " ")))))

(global-set-key (kbd "H-M-SPC") 'fix-whitespace-in-region)
#+END_SRC

*** Multiple cursors
#+BEGIN_SRC emacs-lisp :tangle yes
(req-package multiple-cursors
             :diminish "")
#+END_SRC
*** Fancy narrowing
#+BEGIN_SRC  emacs-lisp :tangle yes
(req-package fancy-narrow
             :diminish ""
             :init (fancy-narrow-mode t))
#+END_SRC
** Search/replace
*** Showing search results
Display 'current match/total matches' in the mode-line in various search modes

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package anzu
             :diminish anzu-mode
             :init (global-anzu-mode +1))
#+END_SRC

*** Regex search/replace
I'm not a big fan of the regular expression syntax in emacs,
so I install visual-regexp-steroids to use Python's regex model.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package visual-regexp-steroids
             :require visual-regexp
             :diminish ""
             :bind (("C-c r" . vr/replace)
                    ("C-c q" . vr/query-replace)
                    ("C-r" . vr/isearch-backward)
                    ("C-s" . vr/isearch-forward)))
#+END_SRC

** Checking
*** Flycheck

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package flycheck
             :require (dash s f exec-path-from-shell flycheck-color-mode-line)
             :ensure flycheck
             :diminish (global-flycheck-mode . " ✓ ")
             :defer t
             :init
             (progn
               (add-hook 'after-init-hook 'global-flycheck-mode)
               (eval-after-load "flycheck"
                 '(add-hook 'flycheck-mode-hook 'flycheck-color-mode-line-mode))
               ))
#+END_SRC

** Killing
*** Browse Kill Ring

KEYBINDING: "M y"

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package browse-kill-ring
             :init (browse-kill-ring-default-keybindings))
#+END_SRC

** Windows
Enable C-c <left> to get back the previous window split

#+BEGIN_SRC emacs-lisp :tangle yes
(winner-mode 1)
#+END_SRC

Allow switching between windows with CTRL+Tab
#+BEGIN_SRC emacs-lisp :tangle yes
(global-set-key [C-tab] 'other-window)
#+END_SRC

I use tmux a lot, and often find when I switch back to emacs
that I use the tmux pane-switch command from muscle memory.
#+BEGIN_SRC emacs-lisp :tangle yes
(global-unset-key [C-b])
(global-set-key [C-b down] 'other-window)
(global-set-key [C-b up] 'previous-multiframe-window)
#+END_SRC

*** Workgroups
Workgroups are a really useful way to manage window layout.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package workgroups
             :diminish ""
             :init
             (progn
               (defun wg-mode-line-add-display () nil)
               (defun wg-mode-line-remove-display () nil)
               (setq wg-prefix-key (kbd "C-z")
                     wg-mode-line-on nil
                     wg-file (concat dotfiles-dir "/workgroups")
                     wg-use-faces nil
                     wg-morph-on nil)
               (workgroups-mode 1)
               ))
#+END_SRC

Note: I disable wg-mode-line as it conflicts with Powerline.

** Version Control
*** Seeing changes when working with Git

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package git-gutter-fringe
             :diminish ""
             :init (global-git-gutter-mode t))
#+END_SRC

*** Magit for working with Git

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package magit)
#+END_SRC

*** Monky for working with Mercirual
By default monky spawns a seperate hg process for every command which  will be slow
if the repo contains lot of changes.

If `monky-process-type' is set to cmdserver then monky will spawn a single
cmdserver and communicate over pipe.

Available only on mercurial versions 1.9 or higher

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package monky
             :init (setq monky-process-type 'cmdserver))
#+END_SRC

** Terminal
*** Colours
Fix colours in ansi-term

#+BEGIN_SRC emacs-lisp :tangle yes
(setq system-uses-terminfo nil)
#+END_SRC

*** ZSH
Always use zshell

#+BEGIN_SRC emacs-lisp :tangle yes
(setq explicit-shell-file-name "/bin/zsh")
#+END_SRC

*** Managing Multiple Terminal instances

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package multi-term)
#+END_SRC

*** Tramp

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package tramp
             :init (setq tramp-default-method "ssh"))
#+END_SRC

** Dired

Clean up dired's display.
#+BEGIN_SRC emacs-lisp :tangle yes
(req-package dired-details+)
#+END_SRC

Handle zip compression.

#+BEGIN_SRC emacs-lisp :tangle yes
(eval-after-load "dired-aux"
  '(add-to-list 'dired-compress-file-suffixes
                '("\\.zip\\'" ".zip" "unzip")))
#+END_SRC


Make sizes human-readable by default, sort version numbers
correctly, and put dotfiles and capital-letters first.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq-default dired-listing-switches "-aGglhvop")
(setq dired-recursive-copies 'always)
#+END_SRC


Dired can execute a command on the file that point is currently on if you
hit =!=. However, this is a blocking operation: nothing else can happen in
emacs while this is running. This is obviously a problem if one wants to,
say, play a movie or do some other long-running operation. =&= will start
the command in the background. Unfortunately, that stores the command's
output in a buffer named "Async Shell Command" which will cause two running
programs to crash into each other and complain. It's possible to ask dired
to come up with a unique name for each:

#+BEGIN_SRC emacs-lisp :tangle yes
(defadvice shell-command (after shell-in-new-buffer (command &optional output-buffer error-buffer))
  (when (get-buffer "*Async Shell Command*")
    (with-current-buffer "*Async Shell Command*"
      (rename-uniquely))))
(ad-activate 'shell-command)
#+END_SRC

Fix problems with =ls= on OS X

#+BEGIN_SRC emacs-lisp :tangle yes
(when (eq system-type 'darwin)
  (req-package ls-lisp
               :init (setq ls-lisp-use-insert-directory-program nil)))
#+END_SRC


Never ask to do recursive copies.

#+BEGIN_SRC emacs-lisp :tangle yes
(setq dired-recursive-copies 'always)
#+END_SRC

Add some custom keybindings

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'dired-mode-hook
          (lambda ()
              (define-key dired-mode-map (kbd "M-<up>") 'dired-up-directory)))
#+END_SRC

** Org-mode
*** Fix keybindings

Org-mode has some very annoying keybindings, which interfere with my preferred keybindings.

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'org-mode-hook
  (lambda()
    (local-unset-key (kbd "C-<tab>")) ; allow switching between frames
    ))

#+END_SRC

*** Bullets
#+BEGIN_SRC emacs-lisp :tangle yes
(req-package org-bullets
             :diminish ""
             :init (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))
#+END_SRC
** Deft

Deft is an Emacs mode for quickly browsing, filtering, and editing
directories of plain text notes, inspired by Notational Velocity.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package deft
             :diminish ""
             :defer t
             :init
             (progn
               (setq deft-directory "~/Dropbox/Notes")
               (setq deft-extension "md")
               (setq deft-text-mode 'markdown-mode)
               (setq deft-use-filename-as-title t)
               ))
#+END_SRC

** Programming
*** Common
Enable CamelCase awareness for all programming modes

#+BEGIN_SRC emacs-lisp :tangle yes
(add-hook 'prog-mode-hook 'subword-mode)
#+END_SRC

*** Python

Add =cython-mode= for working with Cython files.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package cython-mode
             :diminish "")
#+END_SRC

I occasionally use Jinja for templating

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package jinga2-mode
             :diminish ""
             :mode ("\\.jinja2\\'" . jinja2-mode))
#+END_SRC

*** XML

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package xml-mode
             :diminish ""
             :mode ("\\.xsd\\'" . xml-mode))
#+END_SRC

*** XSL-FO

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package xml-mode
             :diminish ""
             :mode ("\\.fo\\'" . xml-mode))
#+END_SRC

*** XQuery

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package xquery-mode
             :diminish ""
             :mode ("\\.xq\\'" . xquery-mode))
#+END_SRC

