config.el

(req-package wrap-region
             :diminish ""
             :init
             (progn
               (wrap-region-global-mode t)
               (setq wrap-region-keep-mark t)
               (add-to-list 'wrap-region-tag-active-modes 'sgml-mode)
               (defadvice wrap-region-trigger (before disable-autopair activate)
                 (if (region-active-p)
                     (autopair-global-mode -1)))
               (defadvice wrap-region-trigger (after re-enable-autopair activate)
                 (if (region-active-p)
                     (autopair-global-mode 1)))
               ))

(req-package iedit)

(add-hook 'sgml-mode-hook
  (lambda ()
    (require 'rename-sgml-tag)
    (define-key sgml-mode-map (kbd "C-c C-r") 'rename-sgml-tag)))

(req-package zencoding-mode
             :diminish ""
             :init (add-hook 'sgml-mode-hook 'zencoding-mode))

(req-package unfill
             :diminish ""
             :init (setq-default fill-column 80))

(setq-default show-trailing-whitespace t)

(defun fix-whitespace-in-region (beg end)
  "replace all whitespace in the region with single spaces"
  (interactive "r")
  (save-excursion
    (save-restriction
      (narrow-to-region beg end)
      (goto-char (point-min))
      (while (re-search-forward "\\s-+" nil t)
        (replace-match " ")))))

(global-set-key (kbd "H-M-SPC") 'fix-whitespace-in-region)

(req-package multiple-cursors
             :diminish "")

(req-package anzu
             :diminish anzu-mode
             :init (global-anzu-mode +1))

(req-package visual-regexp-steroids
             :require visual-regexp
             :diminish ""
             :bind (("C-c r" . vr/replace)
                    ("C-c q" . vr/query-replace)
                    ("C-r" . vr/isearch-backward)
                    ("C-s" . vr/isearch-forward)))

(req-package flycheck
             :require (dash s f exec-path-from-shell flycheck-color-mode-line)
             :ensure flycheck
             :diminish (global-flycheck-mode . " ✓ ")
             :defer t
             :init
             (progn
               (add-hook 'after-init-hook 'global-flycheck-mode)
               (eval-after-load "flycheck"
                 '(add-hook 'flycheck-mode-hook 'flycheck-color-mode-line-mode))
               ))

(req-package browse-kill-ring
             :init (browse-kill-ring-default-keybindings))

(winner-mode 1)

(global-set-key [C-tab] 'other-window)

(global-unset-key [C-b])
(global-set-key [C-b down] 'other-window)
(global-set-key [C-b up] 'previous-multiframe-window)

(req-package workgroups
             :diminish ""
             :init
             (progn
               (defun wg-mode-line-add-display () nil)
               (defun wg-mode-line-remove-display () nil)
               (setq wg-prefix-key (kbd "C-z")
                     wg-mode-line-on nil
                     wg-file (concat dotfiles-dir "/workgroups")
                     wg-use-faces nil
                     wg-morph-on nil)
               (workgroups-mode 1)
               ))

(req-package git-gutter+
             :diminish ""
             :init (global-git-gutter+-mode t))

(req-package magit)

(req-package monky
             :init (setq monky-process-type 'cmdserver))

(setq system-uses-terminfo nil)

(setq explicit-shell-file-name "/bin/zsh")

(req-package multi-term)

(req-package tramp
             :init (setq tramp-default-method "ssh"))

(req-package dired-details+)

(eval-after-load "dired-aux"
  '(add-to-list 'dired-compress-file-suffixes
                '("\\.zip\\'" ".zip" "unzip")))

(setq-default dired-listing-switches "-aGglhvop")
(setq dired-recursive-copies 'always)

(defadvice shell-command (after shell-in-new-buffer (command &optional output-buffer error-buffer))
  (when (get-buffer "*Async Shell Command*")
    (with-current-buffer "*Async Shell Command*"
      (rename-uniquely))))
(ad-activate 'shell-command)

(when (eq system-type 'darwin)
  (req-package ls-lisp
               :init (setq ls-lisp-use-insert-directory-program nil)))

(setq dired-recursive-copies 'always)

(add-hook 'dired-mode-hook
          (lambda ()
              (define-key dired-mode-map (kbd "M-<up>") 'dired-up-directory)))

(add-hook 'org-mode-hook
  (lambda()
    (local-unset-key (kbd "C-<tab>")) ; allow switching between frames
    ))

(req-package org-bullets
             :diminish ""
             :init (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1))))

(req-package deft
             :diminish ""
             :defer t
             :init
             (progn
               (setq deft-directory "~/Dropbox/Notes")
               (setq deft-extension "md")
               (setq deft-text-mode 'markdown-mode)
               (setq deft-use-filename-as-title t)
               ))

(add-hook 'prog-mode-hook 'subword-mode)

(req-package cython-mode
             :diminish "")

(req-package jinga2-mode
             :diminish ""
             :mode ("\\.jinja2\\'" . jinja2-mode))

(req-package xml-mode
             :diminish ""
             :mode ("\\.xsd\\'" . xml-mode))

(req-package xml-mode
             :diminish ""
             :mode ("\\.fo\\'" . xml-mode))

(req-package xquery-mode
             :diminish ""
             :mode ("\\.xq\\'" . xquery-mode))
