config.org
*** YAML

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package yaml-mode
             :diminish ""
             :init
             (progn
               (add-to-list 'auto-mode-alist '("\\.ya?ml" . yaml-mode))
               (add-to-list 'auto-mode-alist '("\\.ylog" . yaml-mode))
               (add-to-list 'auto-mode-alist '("\\.yamlog" . yaml-mode))
               (add-hook 'yaml-mode-hook
                         '(lambda () (define-key yaml-mode-map "\C-m" 'newline-and-indent)))
               ))
#+END_SRC

*** Markdown
#+BEGIN_SRC emacs-lisp :tangle yes
(req-package markdown-mode
             :diminish ""
             :mode ("\\.md\\'" . markdown-mode))
#+END_SRC
*** Fixmee
Allow navigation via "fixme" commends in code

#+BEGIN_SRC  emacs-lisp :tangle yes
(req-package fixmee
             :diminish ""
             :init (global-fixmee-mode 1))
#+END_SRC
** Utilities
*** Find convenient unbound keystrokes

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package unbound)
#+END_SRC

** Finalising

Kick-off the package install.

#+BEGIN_SRC emacs-lisp :tangle yes
(req-package-finish)
#+END_SRC
