config.el

(req-package yaml-mode
             :diminish ""
             :init
             (progn
               (add-to-list 'auto-mode-alist '("\\.ya?ml" . yaml-mode))
               (add-to-list 'auto-mode-alist '("\\.ylog" . yaml-mode))
               (add-to-list 'auto-mode-alist '("\\.yamlog" . yaml-mode))
               (add-hook 'yaml-mode-hook
                         '(lambda () (define-key yaml-mode-map "\C-m" 'newline-and-indent)))
               ))

(req-package markdown-mode
             :diminish ""
             :mode ("\\.md\\'" . markdown-mode))

(req-package unbound)

(req-package-finish)
